Public Attributes | List of all members
API_CWallComponent Struct Reference
Attribute Management
Describes the simple fills contained in composite structures. More...
#include <APIdefs_Attributes.h>
 Public Attributes
API_AttributeIndex  | buildingMaterial
The index of the building material attribute.
short  | framePen
The index of the frame's pen attribute.
short  | flagBits
The meaning of the flags of the composite wall.
double  | fillThick
The absolute thickness of the component in meters.
Detailed Description
Describes the simple fills contained in composite structures.
Remarks
In Archicad 17 composite skins contain a building material index and skin priority is inside the building material.
Member Data Documentation
◆ buildingMaterial
 API_CWallComponent::buildingMaterial
The index of the building material attribute.
◆ fillThick
 API_CWallComponent::fillThick
The absolute thickness of the component in meters.
◆ flagBits
 API_CWallComponent::flagBits
The meaning of the flags of the composite wall.
 Value  | Description
 APICWallComp_Core  | the composite skin is part of the core.
 APICWallComp_Finish  | The composite skin is part of the finish.
◆ framePen
 API_CWallComponent::framePen
The index of the frame's pen attribute.